#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```module.keycloak_test.module.custom_clients.module.test-realm.keycloak_realm.this: Refreshing state... [id=test-realm]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account: Refreshing state... [id=d7a7beed-b14a-4b7c-85fb-41883b3ccd7d]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group.group: Refreshing state... [id=5b79f88c-7acd-4dd7-8f56-71a36decf0bd]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group.group: Refreshing state... [id=e1448a87-3849-4484-8609-6af7cb4fb826]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_role.role: Refreshing state... [id=a44e00e3-6fe8-4317-ba39-7220626fea72]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_openid_client.service_account: Refreshing state... [id=4acb99cc-302e-4fc7-bbed-9e575de2a635]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_group.group: Refreshing state... [id=2c03e36c-f68a-4179-bd14-22f62e7c99af]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_role.role: Refreshing state... [id=2904c8a6-eb21-4e10-b508-6ad6fc87a178]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account: Refreshing state... [id=77337889-1db1-42e0-82df-3030627f4f67]
module.keycloak_dev.module.custom_clients.module.test-realm.keycloak_realm.this: Refreshing state... [id=test-realm]
module.keycloak_prod.module.custom_clients.module.test-realm.keycloak_realm.this: Refreshing state... [id=test-realm]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_role.role: Refreshing state... [id=c80f5534-08eb-47c7-9536-57969cd4f6ef]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group.group: Refreshing state... [id=f5f38878-642f-4d91-9dd1-d84aa446f9d5]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account: Refreshing state... [id=5ed68e9e-408b-4798-89b4-f2fc8e91ac38]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_group.group: Refreshing state... [id=6c70b407-6988-4822-9671-d5301150be65]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_openid_client.service_account: Refreshing state... [id=1d389ae1-9f56-4b5f-92fc-3cd1d9bb2528]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account: Refreshing state... [id=d73bb8bf-fbf6-41c3-91bc-86078474e180]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group.group: Refreshing state... [id=a5df3f72-b6fc-44ae-8c5f-9f004ad4a919]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=test-realm/5b79f88c-7acd-4dd7-8f56-71a36decf0bd]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=ff9e6cea-6a2a-448e-a04f-ddb7a6f92e9f/a44e00e3-6fe8-4317-ba39-7220626fea72]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=test-realm/e1448a87-3849-4484-8609-6af7cb4fb826]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account: Refreshing state... [id=81a91ef5-96b4-44e5-baea-ae6e15ff020d]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account: Refreshing state... [id=694d0cc6-d9a1-4a57-b51d-2462fdc7e5fa]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group.group: Refreshing state... [id=a136bad0-544b-4334-8585-33510096a344]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group.group: Refreshing state... [id=23633992-1062-49d0-a9ba-179c3439cb5c]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_openid_client.service_account: Refreshing state... [id=b418271e-d69f-462a-8327-9cd942f5b0cb]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_group.group: Refreshing state... [id=bae301d6-0b27-425e-8db5-ed8576501b43]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=c149303f-292e-41d8-b05d-df795defe379/2904c8a6-eb21-4e10-b508-6ad6fc87a178]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/2c03e36c-f68a-4179-bd14-22f62e7c99af]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=ce3c3815-35b6-45de-b661-a945f085dbdf/c80f5534-08eb-47c7-9536-57969cd4f6ef]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_role.role: Refreshing state... [id=f1f9f9ec-d4d1-4bef-bc5f-f1a26ee4ab9e]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_role.role: Refreshing state... [id=a584eb6c-9c0e-4878-a90e-6f02feb7a89e]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_role.role: Refreshing state... [id=5bed50e8-bbc8-4b07-ab8e-27898f3c5911]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_role.role: Refreshing state... [id=b3e4bf7a-07bc-4fd5-a353-a8a0f3f6c399]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_role.role: Refreshing state... [id=ea24227a-77d5-46cf-a759-075811d039f7]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_role.role: Refreshing state... [id=6161ff73-bf84-4e6e-ade7-fb61fdbf476c]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=b2742314-9618-4e51-9c4f-41e8765da705/f1f9f9ec-d4d1-4bef-bc5f-f1a26ee4ab9e]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=test-realm/f5f38878-642f-4d91-9dd1-d84aa446f9d5]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=7ebd38cf-dccc-474a-964a-e3bed5bf6cf2/b3e4bf7a-07bc-4fd5-a353-a8a0f3f6c399]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=test-realm/a136bad0-544b-4334-8585-33510096a344]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/bae301d6-0b27-425e-8db5-ed8576501b43]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=173c01d6-0308-499f-abfb-fb4303761b8d/ea24227a-77d5-46cf-a759-075811d039f7]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=test-realm/a5df3f72-b6fc-44ae-8c5f-9f004ad4a919]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=be7442f8-5b04-484a-b43e-30ef04e8e959/a584eb6c-9c0e-4878-a90e-6f02feb7a89e]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/6c70b407-6988-4822-9671-d5301150be65]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=9a7cc670-882b-4bf0-80dc-60e7718668d8/5bed50e8-bbc8-4b07-ab8e-27898f3c5911]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=test-realm/23633992-1062-49d0-a9ba-179c3439cb5c]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=66ca7cb9-37a1-4869-9400-346073b31031/6161ff73-bf84-4e6e-ade7-fb61fdbf476c]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_test.module.custom_clients.module.test-realm.keycloak_realm.this has been deleted
  - resource "keycloak_realm" "this" {
      - access_code_lifespan                     = "1m0s" -> null
      - access_code_lifespan_login               = "30m0s" -> null
      - access_code_lifespan_user_action         = "5m0s" -> null
      - access_token_lifespan                    = "5m0s" -> null
      - access_token_lifespan_for_implicit_flow  = "15m0s" -> null
      - action_token_generated_by_admin_lifespan = "12h0m0s" -> null
      - action_token_generated_by_user_lifespan  = "5m0s" -> null
      - attributes                               = {} -> null
      - browser_flow                             = "browser" -> null
      - client_authentication_flow               = "clients" -> null
      - client_session_idle_timeout              = "0s" -> null
      - client_session_max_lifespan              = "0s" -> null
      - default_default_client_scopes            = [] -> null
      - default_optional_client_scopes           = [] -> null
      - direct_grant_flow                        = "direct grant" -> null
      - docker_authentication_flow               = "docker auth" -> null
      - duplicate_emails_allowed                 = false -> null
      - edit_username_allowed                    = false -> null
      - enabled                                  = true -> null
      - id                                       = "test-realm" -> null
      - internal_id                              = "test-realm" -> null
      - login_with_email_allowed                 = false -> null
      - oauth2_device_code_lifespan              = "10m0s" -> null
      - oauth2_device_polling_interval           = 5 -> null
      - offline_session_idle_timeout             = "720h0m0s" -> null
      - offline_session_max_lifespan             = "1440h0m0s" -> null
      - offline_session_max_lifespan_enabled     = false -> null
      - realm                                    = "test-realm" -> null
      - refresh_token_max_reuse                  = 0 -> null
      - registration_allowed                     = false -> null
      - registration_email_as_username           = false -> null
      - registration_flow                        = "registration" -> null
      - remember_me                              = false -> null
      - reset_credentials_flow                   = "reset credentials" -> null
      - reset_password_allowed                   = false -> null
      - revoke_refresh_token                     = false -> null
      - ssl_required                             = "external" -> null
      - sso_session_idle_timeout                 = "30m0s" -> null
      - sso_session_idle_timeout_remember_me     = "0s" -> null
      - sso_session_max_lifespan                 = "10h0m0s" -> null
      - sso_session_max_lifespan_remember_me     = "0s" -> null
      - user_managed_access                      = false -> null
      - verify_email                             = false -> null

      - otp_policy {
          - algorithm         = "HmacSHA1" -> null
          - digits            = 6 -> null
          - initial_counter   = 0 -> null
          - look_ahead_window = 1 -> null
          - period            = 30 -> null
          - type              = "totp" -> null
        }

      - web_authn_passwordless_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }

      - web_authn_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group.group has been deleted
  - resource "keycloak_group" "group" {
      - attributes = {} -> null
      - id         = "5b79f88c-7acd-4dd7-8f56-71a36decf0bd" -> null
      - name       = "Realm Administrator" -> null
      - path       = "/Realm Administrator" -> null
      - realm_id   = "test-realm" -> null
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding has been deleted
  - resource "keycloak_group_roles" "role_group_binding" {
      - exhaustive = true -> null
      - group_id   = "5b79f88c-7acd-4dd7-8f56-71a36decf0bd" -> null
      - id         = "test-realm/5b79f88c-7acd-4dd7-8f56-71a36decf0bd" -> null
      - realm_id   = "test-realm" -> null
      - role_ids   = [
          - "a44e00e3-6fe8-4317-ba39-7220626fea72",
        ] -> null
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account has been deleted
  - resource "keycloak_openid_client" "service_account" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "realm-admin-cli" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = true -> null
      - id                                         = "d7a7beed-b14a-4b7c-85fb-41883b3ccd7d" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "realm-admin-cli" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "test-realm" -> null
      - service_account_user_id                    = "ff9e6cea-6a2a-448e-a04f-ddb7a6f92e9f" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = false -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding has been deleted
  - resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      - id                      = "ff9e6cea-6a2a-448e-a04f-ddb7a6f92e9f/a44e00e3-6fe8-4317-ba39-7220626fea72" -> null
      - realm_id                = "test-realm" -> null
      - role                    = "realm-admin" -> null
      - service_account_user_id = "ff9e6cea-6a2a-448e-a04f-ddb7a6f92e9f" -> null
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_role.role has been deleted
  - resource "keycloak_role" "role" {
      - attributes      = {} -> null
      - composite_roles = [
          - "4f224e17-7bb4-4502-b52e-aad95245a9d1",
        ] -> null
      - id              = "a44e00e3-6fe8-4317-ba39-7220626fea72" -> null
      - name            = "realm-admin" -> null
      - realm_id        = "test-realm" -> null
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group.group has been deleted
  - resource "keycloak_group" "group" {
      - attributes = {} -> null
      - id         = "e1448a87-3849-4484-8609-6af7cb4fb826" -> null
      - name       = "Realm Viewer" -> null
      - path       = "/Realm Viewer" -> null
      - realm_id   = "test-realm" -> null
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding has been deleted
  - resource "keycloak_group_roles" "role_group_binding" {
      - exhaustive = true -> null
      - group_id   = "e1448a87-3849-4484-8609-6af7cb4fb826" -> null
      - id         = "test-realm/e1448a87-3849-4484-8609-6af7cb4fb826" -> null
      - realm_id   = "test-realm" -> null
      - role_ids   = [
          - "2904c8a6-eb21-4e10-b508-6ad6fc87a178",
        ] -> null
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account has been deleted
  - resource "keycloak_openid_client" "service_account" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "realm-viewer-cli" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = true -> null
      - id                                         = "77337889-1db1-42e0-82df-3030627f4f67" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "realm-viewer-cli" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "test-realm" -> null
      - service_account_user_id                    = "c149303f-292e-41d8-b05d-df795defe379" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = false -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding has been deleted
  - resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      - id                      = "c149303f-292e-41d8-b05d-df795defe379/2904c8a6-eb21-4e10-b508-6ad6fc87a178" -> null
      - realm_id                = "test-realm" -> null
      - role                    = "realm-viewer" -> null
      - service_account_user_id = "c149303f-292e-41d8-b05d-df795defe379" -> null
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_role.role has been deleted
  - resource "keycloak_role" "role" {
      - attributes      = {} -> null
      - composite_roles = [
          - "1c428761-2e66-4dbf-9a53-54560d076921",
          - "3b89f42f-3cb5-48ff-9487-b7eee23a235f",
          - "7628e8d9-d6dd-4f02-9ce9-0e0d58a5445e",
          - "9cb673d9-3455-4853-8aba-25e4bd26a0c5",
          - "a0ce6965-4528-4292-8604-1b1a4f62f8c3",
          - "bcad237e-1d65-4c5d-be09-7edeca73b20b",
        ] -> null
      - id              = "2904c8a6-eb21-4e10-b508-6ad6fc87a178" -> null
      - name            = "realm-viewer" -> null
      - realm_id        = "test-realm" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_test.module.custom_clients.module.test-realm.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "test-realm"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      ~ access_type                                = "BEARER-ONLY" -> (known after apply)
      + admin_url                                  = (known after apply)
      ~ authentication_flow_binding_overrides      = [] -> (known after apply)
      ~ authorization                              = [] -> (known after apply)
      ~ backchannel_logout_revoke_offline_sessions = false -> (known after apply)
      ~ backchannel_logout_session_required        = false -> (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      ~ client_authenticator_type                  = "client-secret" -> (known after apply)
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      ~ consent_required                           = false -> (known after apply)
      + description                                = (known after apply)
      ~ direct_access_grants_enabled               = false -> (known after apply)
      - display_on_consent_screen                  = false -> null
      ~ enabled                                    = true -> (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      ~ extra_config                               = {} -> (known after apply)
      ~ frontchannel_logout_enabled                = false -> (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      ~ full_scope_allowed                         = false -> (known after apply)
      ~ id                                         = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ implicit_flow_enabled                      = false -> (known after apply)
      + login_theme                                = (known after apply)
      ~ name                                       = "test-realm Realm" -> (known after apply)
      - oauth2_device_authorization_grant_enabled  = false -> null
      + pkce_code_challenge_method                 = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ service_accounts_enabled                   = false -> (known after apply)
      ~ standard_flow_enabled                      = true -> (known after apply)
      ~ use_refresh_tokens                         = false -> (known after apply)
      ~ use_refresh_tokens_client_credentials      = false -> (known after apply)
      ~ valid_redirect_uris                        = [] -> (known after apply)
      ~ web_origins                                = [] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["create-client"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_create-client}" -> (known after apply)
      ~ id              = "8342f51a-4913-4a2e-b3d7-43560ca564a8" -> (known after apply)
        name            = "create-client"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["impersonation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_impersonation}" -> (known after apply)
      ~ id              = "07cde061-36e6-4d07-8c12-b4cf5aa92580" -> (known after apply)
        name            = "impersonation"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-authorization}" -> (known after apply)
      ~ id              = "5f14af3f-86aa-4895-a31a-96c222d7ec14" -> (known after apply)
        name            = "manage-authorization"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-clients}" -> (known after apply)
      ~ id              = "22f79828-05c1-4195-9338-5e267f2b97fb" -> (known after apply)
        name            = "manage-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-events}" -> (known after apply)
      ~ id              = "0637b32f-1268-4074-b022-5b74e940e215" -> (known after apply)
        name            = "manage-events"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-identity-providers}" -> (known after apply)
      ~ id              = "9c1b5c5c-a39b-4426-be20-d4b81436e454" -> (known after apply)
        name            = "manage-identity-providers"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-realm}" -> (known after apply)
      ~ id              = "f7060369-32f7-44bf-a91f-e74b783cccc2" -> (known after apply)
        name            = "manage-realm"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-users}" -> (known after apply)
      ~ id              = "6db74fb2-f5b0-47b9-89a4-4d89e0d0fb1d" -> (known after apply)
        name            = "manage-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-clients}" -> (known after apply)
      ~ id              = "29826e2d-d18a-439f-9cc5-408c51f25fdd" -> (known after apply)
        name            = "query-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-groups"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-groups}" -> (known after apply)
      ~ id              = "184133ac-8478-4d92-9e09-d0551a1fcca2" -> (known after apply)
        name            = "query-groups"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-realms"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-realms}" -> (known after apply)
      ~ id              = "d6de4d96-ccbd-498f-90f2-19f1ee0ef38f" -> (known after apply)
        name            = "query-realms"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-users}" -> (known after apply)
      ~ id              = "db44961b-b414-466f-932b-6c12ec81ddcc" -> (known after apply)
        name            = "query-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-authorization}" -> (known after apply)
      ~ id              = "aa9fa883-7876-46ff-8c8d-a0929c38f05b" -> (known after apply)
        name            = "view-authorization"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-clients}" -> (known after apply)
      ~ id              = "1be59a80-bb46-4060-b5ae-284e94763a51" -> (known after apply)
        name            = "view-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-events}" -> (known after apply)
      ~ id              = "768e69f1-7e1a-4b6d-8cf4-5afbc590e8ce" -> (known after apply)
        name            = "view-events"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-identity-providers}" -> (known after apply)
      ~ id              = "ea73a69b-4f10-4d8e-b765-1592f80f13c1" -> (known after apply)
        name            = "view-identity-providers"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-realm}" -> (known after apply)
      ~ id              = "73267923-d54a-4a80-90b1-c232da7dd039" -> (known after apply)
        name            = "view-realm"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "e423ae1a-999b-46d0-9e1f-13f8f13742b1" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-users}" -> (known after apply)
      ~ id              = "504706de-2986-43fe-8d54-96399239d42f" -> (known after apply)
        name            = "view-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_role.role will be updated in-place
  ~ resource "keycloak_role" "role" {
      ~ composite_roles = [
          - "0637b32f-1268-4074-b022-5b74e940e215",
          - "07cde061-36e6-4d07-8c12-b4cf5aa92580",
          - "184133ac-8478-4d92-9e09-d0551a1fcca2",
          - "1be59a80-bb46-4060-b5ae-284e94763a51",
          - "22f79828-05c1-4195-9338-5e267f2b97fb",
          - "29826e2d-d18a-439f-9cc5-408c51f25fdd",
          - "504706de-2986-43fe-8d54-96399239d42f",
          - "5f14af3f-86aa-4895-a31a-96c222d7ec14",
          - "6db74fb2-f5b0-47b9-89a4-4d89e0d0fb1d",
          - "73267923-d54a-4a80-90b1-c232da7dd039",
          - "768e69f1-7e1a-4b6d-8cf4-5afbc590e8ce",
          - "8342f51a-4913-4a2e-b3d7-43560ca564a8",
          - "9c1b5c5c-a39b-4426-be20-d4b81436e454",
          - "aa9fa883-7876-46ff-8c8d-a0929c38f05b",
          - "d6de4d96-ccbd-498f-90f2-19f1ee0ef38f",
          - "db44961b-b414-466f-932b-6c12ec81ddcc",
          - "ea73a69b-4f10-4d8e-b765-1592f80f13c1",
          - "f7060369-32f7-44bf-a91f-e74b783cccc2",
        ] -> (known after apply)
        id              = "c80f5534-08eb-47c7-9536-57969cd4f6ef"
        name            = "test-realm-realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      ~ access_type                                = "BEARER-ONLY" -> (known after apply)
      + admin_url                                  = (known after apply)
      ~ authentication_flow_binding_overrides      = [] -> (known after apply)
      ~ authorization                              = [] -> (known after apply)
      ~ backchannel_logout_revoke_offline_sessions = false -> (known after apply)
      ~ backchannel_logout_session_required        = false -> (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      ~ client_authenticator_type                  = "client-secret" -> (known after apply)
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      ~ consent_required                           = false -> (known after apply)
      + description                                = (known after apply)
      ~ direct_access_grants_enabled               = false -> (known after apply)
      - display_on_consent_screen                  = false -> null
      ~ enabled                                    = true -> (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      ~ extra_config                               = {} -> (known after apply)
      ~ frontchannel_logout_enabled                = false -> (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      ~ full_scope_allowed                         = false -> (known after apply)
      ~ id                                         = "b8ca6fed-7952-4ff8-be28-31a3fc3a9150" -> (known after apply)
      ~ implicit_flow_enabled                      = false -> (known after apply)
      + login_theme                                = (known after apply)
      ~ name                                       = "${client_realm-management}" -> (known after apply)
      - oauth2_device_authorization_grant_enabled  = false -> null
      + pkce_code_challenge_method                 = (known after apply)
      ~ realm_id                                   = "test-realm" -> (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ service_accounts_enabled                   = false -> (known after apply)
      ~ standard_flow_enabled                      = true -> (known after apply)
      ~ use_refresh_tokens                         = false -> (known after apply)
      ~ use_refresh_tokens_client_credentials      = false -> (known after apply)
      ~ valid_redirect_uris                        = [] -> (known after apply)
      ~ web_origins                                = [] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.data.keycloak_role.target_roles["realm-admin"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "b8ca6fed-7952-4ff8-be28-31a3fc3a9150" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_realm-admin}" -> (known after apply)
      ~ id              = "4f224e17-7bb4-4502-b52e-aad95245a9d1" -> (known after apply)
        name            = "realm-admin"
      ~ realm_id        = "test-realm" -> (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      ~ access_type                                = "BEARER-ONLY" -> (known after apply)
      + admin_url                                  = (known after apply)
      ~ authentication_flow_binding_overrides      = [] -> (known after apply)
      ~ authorization                              = [] -> (known after apply)
      ~ backchannel_logout_revoke_offline_sessions = false -> (known after apply)
      ~ backchannel_logout_session_required        = false -> (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      ~ client_authenticator_type                  = "client-secret" -> (known after apply)
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      ~ consent_required                           = false -> (known after apply)
      + description                                = (known after apply)
      ~ direct_access_grants_enabled               = false -> (known after apply)
      - display_on_consent_screen                  = false -> null
      ~ enabled                                    = true -> (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      ~ extra_config                               = {} -> (known after apply)
      ~ frontchannel_logout_enabled                = false -> (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      ~ full_scope_allowed                         = false -> (known after apply)
      ~ id                                         = "b8ca6fed-7952-4ff8-be28-31a3fc3a9150" -> (known after apply)
      ~ implicit_flow_enabled                      = false -> (known after apply)
      + login_theme                                = (known after apply)
      ~ name                                       = "${client_realm-management}" -> (known after apply)
      - oauth2_device_authorization_grant_enabled  = false -> null
      + pkce_code_challenge_method                 = (known after apply)
      ~ realm_id                                   = "test-realm" -> (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ service_accounts_enabled                   = false -> (known after apply)
      ~ standard_flow_enabled                      = true -> (known after apply)
      ~ use_refresh_tokens                         = false -> (known after apply)
      ~ use_refresh_tokens_client_credentials      = false -> (known after apply)
      ~ valid_redirect_uris                        = [] -> (known after apply)
      ~ web_origins                                = [] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "b8ca6fed-7952-4ff8-be28-31a3fc3a9150" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-authorization}" -> (known after apply)
      ~ id              = "1c428761-2e66-4dbf-9a53-54560d076921" -> (known after apply)
        name            = "view-authorization"
      ~ realm_id        = "test-realm" -> (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "b8ca6fed-7952-4ff8-be28-31a3fc3a9150" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-clients}" -> (known after apply)
      ~ id              = "3b89f42f-3cb5-48ff-9487-b7eee23a235f" -> (known after apply)
        name            = "view-clients"
      ~ realm_id        = "test-realm" -> (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "b8ca6fed-7952-4ff8-be28-31a3fc3a9150" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-events}" -> (known after apply)
      ~ id              = "7628e8d9-d6dd-4f02-9ce9-0e0d58a5445e" -> (known after apply)
        name            = "view-events"
      ~ realm_id        = "test-realm" -> (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "b8ca6fed-7952-4ff8-be28-31a3fc3a9150" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-identity-providers}" -> (known after apply)
      ~ id              = "9cb673d9-3455-4853-8aba-25e4bd26a0c5" -> (known after apply)
        name            = "view-identity-providers"
      ~ realm_id        = "test-realm" -> (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "b8ca6fed-7952-4ff8-be28-31a3fc3a9150" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-realm}" -> (known after apply)
      ~ id              = "bcad237e-1d65-4c5d-be09-7edeca73b20b" -> (known after apply)
        name            = "view-realm"
      ~ realm_id        = "test-realm" -> (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "b8ca6fed-7952-4ff8-be28-31a3fc3a9150" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-users}" -> (known after apply)
      ~ id              = "a0ce6965-4528-4292-8604-1b1a4f62f8c3" -> (known after apply)
        name            = "view-users"
      ~ realm_id        = "test-realm" -> (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = (known after apply)
    }

Plan: 11 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...```

</details>

*Pusher: @NithinKuruba, Action: `pull_request`*